NCL/NCL-SOAPInput-Example-20130404.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:q0="http://assisted-search.ncl.com/services" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ncl:GetAssistedSearchRecommendation
			xmlns:ncl="http://assisted-search.ncl.com/messages" xsi:schemaLocation="http://assisted-search.ncl.com/messages NCL-AssistedSearch.xsd">
			<destinationSet>
				<destination>PANAMA_CANAL</destination>
				<destination>BAHAMAS_FLORIDA</destination>
			</destinationSet>
			<accomodationSet>
				<accomodation>BALCONY</accomodation>
				<accomodation>SUITE</accomodation>
			</accomodationSet>
			<thingToDoSet>
				<thingToDo>adventure</thingToDo>
				<thingToDo>wildlife_toures</thingToDo>
				<thingToDo>city_tours</thingToDo>
				<thingToDo>beach</thingToDo>
			</thingToDoSet>
			<interestSet>
				<interest>Family Fun</interest>
				<interest>Relaxing</interest>
			</interestSet>
			<departurePortSet>
				<departurePort>BCN</departurePort>
				<departurePort>MIA</departurePort>
			</departurePortSet>
			<durationSet>
				<duration>1,6</duration>
				<duration>9,11</duration>
				<duration>20,99</duration>
			</durationSet>
			<flexDatesSet>
				<startDate>2013-03-01</startDate>
				<endDate>2013-03-21</endDate>
			</flexDatesSet>
			<discTypes>
				<BEST-FAIR>true</BEST-FAIR>
				<military>false</military>
				<AARP>true</AARP>
				<latitudes>false</latitudes>
				<senior>false</senior>
				<stateCode />
			</discTypes>
			<priceRangeSet>
				<priceRange>100.00,200.00</priceRange>
				<priceRange>250.00,2000.00</priceRange>
			</priceRangeSet>
			<stateroomView>MoreImportant</stateroomView>
			<stateroomSpace>NoPreference</stateroomSpace>
			<stateroomLocation>LessImportant</stateroomLocation>
			<numberOfGuests>2</numberOfGuests>
			<userWeightSet>
				<wc1>0.2</wc1>
				<wc2>0.4</wc2>
				<wc3>0.6</wc3>
				<wc4>0.8</wc4>
				<wc5>1.0</wc5>
			</userWeightSet>
			<recommReqLimitSet>
				<numPackageRecomm>2</numPackageRecomm>
				<numThingsToDo>2</numThingsToDo>
				<numDest>2</numDest>
				<numStateRoomTypes>2</numStateRoomTypes>
			</recommReqLimitSet>
		</ncl:GetAssistedSearchRecommendation>
	</soapenv:Body>
</soapenv:Envelope>